---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Clear
source: html/253e3af0-d69a-b830-a68b-c2254325348a.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.Clear Method

Removes every wire material type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```